# Connecting to a Database (MySQL)

In [ ]:
!pip install mysql-connector-python

In [2]:
import pandas as pd
import mysql.connector

In [5]:
connect = mysql.connector.connect(
host = 'localhost',
user = 'root',
password = 'PandasTutorial',
database = 'parks_and_recreation'
)

In [6]:
query = 'SELECT * FROM parks_and_recreation.employee_demographics'

In [7]:
pd.read_sql(query,connect)

C:\Users\alexf\AppData\Local\Temp\ipykernel_174116\2253160645.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query,connect)

    employee_id    first_name     last_name   age  gender  birth_date
0             1        Leslie         Knope  44.0  Female  1979-09-25
1             3           Tom     Haverford  36.0    Male  1987-03-04
2             4         April       Ludgate  29.0  Female  1994-03-27
3             6         Donna        Meagle  46.0  Female  1977-07-30
4             7           Ann       Perkins  35.0  Female  1988-12-01
5             8         Chris       Traeger  43.0    Male  1980-11-11
6             9           Ben         Wyatt  38.0    Male  1985-07-26
7            10          Andy         Dwyer  34.0    Male  1989-03-25
8            11          Mark  Brendanawicz  40.0    Male  1983-06-14
9            12         Craig  Middlebrooks  37.0    Male  1986-07-27
10           13  Jean-Ralphio    Saperstein   NaN    None        None

In [8]:
connect.close()